package com.atguigu.bigdata.java.chapter03;

public class Java_TestOper4 {
    public static void main(String[] args) {
        while ( true ) {

        }
       // int i = 1 + 1;

       // 1;
//        byte b = 127;
//        b = (byte)(b+1);
//        System.out.println(b);

        //
        // 0111 1111 => 127 => byte(8)
        //         1
        //------------------
        // 0000 0000 0000 0000 0000 0000 1000 0000 => int(32)
        //                               1000 0000 =>
        // -------------------------------------------
        //                               1000 0000 => -128
        //                               1111 1111 => -1
        // -128 + 1 => -127 => 1000 0001
        // 1 + 111 1111
        // 负数 + 7位最大值
        // 8位中负数的最大值 = -1

        // 1000 0000
        // 负数 + 7位最小值
        // 8位中负数的最小值 = -128

        // 负数的二进制表现方式
        // 补码 ： 绝对值 按位取反加一
        // -1
        // 1 => 0000 0001
        // =>   1111 1110
        // =>   1111 1111
    }
}
